# Настройка VLAN
## Краткое воспоминание о VLAN
![alt text](image.png)

VLAN создаёт отдельную логическую сеть, разделяя интерфейсы коммутатора на разные сегменты сети, которые эмулируют работу локальной сети. Т.к все действия происходят в пределах одного коммутатора, то такие сети считаются виртуальными локальными сетями
  
Ограничивает широковещательный домен
  

Один порт коммутатора одна VLAN
  
Разделение на отдельные IP сети не спасает от широковещательной рассылки

## Настройка VLAN на коммутаторе

Прежде чем работать с VLAN, их необходимо создать. По умолчанию, создаются VLAN 1, VLANы, использующиеся для определенных типов сетей, которые уже устарели. Работать с VLANами по умолчанию **не желательно**

  
**Создавать VLAN будем на коммутаторах(L2 или L3)**, т.к VLAN относится к понятиям локальной, коммутируемой среды

#### Создание VLAN:
```
S(config)# vlan vlan_id // vlan_id - это номер VLAN
S(config-vlan)# name vlan_name // vlan_name - даём имя, чтобы при просмотре конфигурации его было проще отследить 
S(config-vlan)# exit
```
![alt text](image-1.png)

### Просмотр созданных VLAN
команда покажет все созданные VLAN, а также как распределены порты по VLAN
```
S# show vlan brief
```

![alt text](image-5.png)



Покажет кол-во созданных VLAN, в том числе расширенных VLAN
```
S1# show vlan summary
```
![alt text](image-6.png)

Покажет настройки конкретной VLAN
```
S1# show vlan name vlan_name
```
![alt text](image-7.png)


```
S1# show interfaces interface_name switchport 
```

*Само по себе создание VLAN ещё не даёт нам полноценной работы VLAN с разделением портов по разным VLAN.* ***Поэтому нужно помещать порты коммутатора в созданные нами VLAN***

### Добавление портов в VLAN

Схема сети для картинок с примерами

![alt text](image-4.png)

> S(config)# interface interface_id

> S(config-if)# switchport mode access // *включаем режим работы доступа на порте коммутатора, т.е порт ведет к клиентам и будет помещен в какую-то VLAN.*

> S(config-if)# switchport access vlan vlan_id // *Указываем куда помещаем порт, если не вводить эту строку, то порт по умолчанию помещается в VLAN 1*

![alt text](image-2.png)

После такой настройки, интерфейс работает только в этом VLAN

  
Режим работы access не рекомендуется использовать для интерфейсов, ведущих к другому сетевому оборудованию(свитчам и роутерам). **Режим access подходит только для работы с клиентами !!!**

**Если к интерфейсу подключена IP телефония, то команда добавления порта в VLAN будет такой:**
> S(config-if)# switchport voice vlan vlan_id

![alt text](image-3.png)